Autodesk.Revit.DB.BuiltInFailures.AnalyticalAutomationFailures.LevelsHiddenInViewWarning
Some levels are hidden. The alignment plans will also consider the hidden levels.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalAutomationFailures.EmptySelection
There are no selected elements.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalAutomationFailures.DeleteGeneratedPlans
You are about to change your selection. Updating your selection will delete the existing reference plans.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalAutomationFailures
Failures about Analytical Automation.